using System;



class Program
{
    static void Main()
    {
        //3.Напишете израз, който да проверява дали третата цифра(отдясно на ляво) на дадено цяло число е 7.
        //3.Разделете числото на 100 и го запишете в нова променлива. Нея разделете на 10 и вземете остатъкът.
        //Остатъкът от делението на 10 е третата цифра от първоначалното число. Проверете равна ли е на 7.


        int number = 25791;
        Console.WriteLine(number / 100);
        int number1 = 257;
        Console.WriteLine(number1 % 10);
        Console.WriteLine((number / 100 ) % 10 ==7 ? true : false);


    }
}

