using System;



class Program
{
    static void Main()
    {
        //9.Напишете програма, която проверява дали дадена точка О(x, y) е вътре в окръжността К((0, 0), 5)
        // и едновременно с това извън право­ъгълника((-1, 1), (5, 5).
        //Пояснение: правоъгълникът е зададен чрез координатите на горния си ляв и долния си десен ъгъл.
        //Използвайте кода от предходната задача и добавете проверка за правоъгълника.Една точка е вътре в даден
        //правоъгълник със стени успоредни на координатните оси, когато е вдясно от лявата му стена, 
        //вляво от дясната му стена, надолу от горната му стена и нагоре от долната му стена.
        Console.Write("Enter co-ordination x:");
        int x = Convert.ToInt32(Console.ReadLine());
        Console.Write("Enter co-ordination y:");
        int y = Convert.ToInt32(Console.ReadLine());
        bool trust = 

    }
}

